// Створити масив об'єктів користувачів - кожен користувач має два параметри: ім'я та вік. +
// Розширити вирішення задачі: цикл повинен ітерувати через масив користувачів, 
// і всередині циклу використовувати функцію для розрахунку вартості квитки.
//  На екран вивести ім'я користувача та вартість квитка для нього. 
let users = [
    { name: "Daria", age: 12 },
    { name: "Anastasiia", age: 30 },
    { name: "Olena", age: 63 },
    { name: "Charlie", age: 121 }
];

function calculatePrice(age) {
    let age = user.age
    if (age < 12 ) {
        return 5;
    }
     if (age >= 12 && age <= 60) {
            return 10;
        } else {
            return 7;
        }
        }

for(let i = 0; i < users.length; i++){
    
}